src/test/resources/request.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <getCountryRequest xmlns="http://alekseysamoylov.com/countries">
      <name>Poland</name>
    </getCountryRequest>
  </Body>
</Envelope>
